---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AreaBasedLoadType.LoadDensity
source: html/c5e2214a-d88b-11aa-e981-301abed3ff5e.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadType.LoadDensity Property

The load density of area based load type.

## Syntax (C#)
```csharp
public double LoadDensity { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The given value for value is not a number
 -or-
 When setting this property: The given value for value is not finite
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for value must be non-negative.